# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'node'
brew 'redis'
brew 'curl', args: ['with-openssl']
brew 'python@2'
brew 'python'
brew 'diff-so-fancy'
brew 'colordiff'
brew 'docker-clean'


# Apps
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite' # encryption service
cask 'insomnia' # like postman
cask 'java'
cask 'skype'
cask 'slack'
cask 'visual-studio-code'
cask 'iterm2'
cask 'postman'
cask 'spotify'
cask 'spectacle'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
